# Numpy

In [72]:
import numpy as np

### astype()

In [73]:
#기본값 int32인 정수 데이터를 int16으로 변경
x = np.array([1,2,3,4])
print('before : ', x.dtype)
x = x.astype(np.int16)
print('after : ', x.dtype)

before :  int32
after :  int16

### sum(x,axis = n)

In [74]:
arr = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
print(arr)
print(np.sum(arr))
print(np.sum(arr, axis=0))
print(np.sum(arr, axis=1))

[[1 2 3]
 [4 5 6]
 [7 8 9]]
45
[12 15 18]
[ 6 15 24]

# Pandas

In [75]:
import pandas as pd

In [76]:
sr = pd.Series([1,2,3,4],name='A')
print('type : ',type(sr))
print('dtype : ', sr.dtype)
print(sr)

type :  <class 'pandas.core.series.Series'>
dtype :  int64
0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [77]:
sr = pd.Series([1,2,3,4],index=['A','B','C','D'])
print('type : ',type(sr))
print('dtype : ', sr.dtype)
print(sr)

type :  <class 'pandas.core.series.Series'>
dtype :  int64
A    1
B    2
C    3
D    4
dtype: int64

## Titanic csv

In [78]:
titanic = pd.read_csv('titanic.csv')
print('type : ',type(titanic))
print('shape : ',titanic.shape)

type :  <class 'pandas.core.frame.DataFrame'>
shape :  (891, 12)

In [79]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    object
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(3), object(7)
memory usage: 83.7+ KB

In [80]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [81]:
titanic.columns.to_list()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [82]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

In [83]:
titanic.describe()

       PassengerId         Age       SibSp       Parch        Fare
count   891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000   29.699118    0.523008    0.381594   32.204208
std     257.353842   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.500000   20.125000    0.000000    0.000000    7.910400
50%     446.000000   28.000000    0.000000    0.000000   14.454200
75%     668.500000   38.000000    1.000000    0.000000   31.000000
max     891.000000   80.000000    8.000000    6.000000  512.329200

In [84]:
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,lost,3rd,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,saved,1st,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,saved,3rd,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## 결측치 확인

In [85]:
titanic.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [86]:
tmp = titanic.copy()
tmp = tmp.dropna()
tmp.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [87]:
tmp2 = titanic.copy()
tmp2 = tmp.fillna(0)
tmp2.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [88]:
titanic.columns = titanic.columns.str.lower()
titanic

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,lost,3rd,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,saved,1st,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,saved,3rd,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,saved,1st,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,lost,3rd,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,lost,2nd,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,saved,1st,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,lost,3rd,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,saved,1st,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,lost,3rd,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [96]:
a_mean = titanic['age'].mean
titanic['age'] = titanic['age'].fillna(a_mean)

In [98]:
titanic.isna().sum()

passengerid      0
survived         0
pclass           0
name             0
sex              0
age              0
sibsp            0
parch            0
ticket           0
fare             0
cabin          687
embarked         2
dtype: int64

In [108]:
x = [['Jackson', 68, True, 0.82, 'A'],
['Liam', 74, True, 1.1, 'B'],
['Emma', 52, False, 0.89, 'C'],
['James', 78, True, 0.91, 'C'],
['Ava', 54, False, 0.73, 'B'],
['Henry', 69, True, 0.78, 'C']]
df = pd.DataFrame(x, columns=['Name', 'Weight', 'Option',
 'Rate', 'Type'])
df

      Name  Weight  Option  Rate Type
0  Jackson      68    True  0.82    A
1     Liam      74    True  1.10    B
2     Emma      52   False  0.89    C
3    James      78    True  0.91    C
4      Ava      54   False  0.73    B
5    Henry      69    True  0.78    C

In [113]:
# loc[]에 인덱스 대신해서 조건을 설정한다. 아래 예제는 'Rate' 컬럼의 값이 0.8보다 큰 행만 추출한다.
x = df.loc[df['Rate']>0.8]
x

      Name  Weight  Option  Rate Type
0  Jackson      68    True  0.82    A
1     Liam      74    True  1.10    B
2     Emma      52   False  0.89    C
3    James      78    True  0.91    C

In [116]:
x = df.loc[(df['Rate']>0.8)&(df['Option']==True)]
x

      Name  Weight  Option  Rate Type
0  Jackson      68    True  0.82    A
1     Liam      74    True  1.10    B
3    James      78    True  0.91    C

In [117]:
x = [['Jackson', 68, True, 0.82, 'A'],
['Liam', 74, True, 1.1, 'B'],
['Emma', 52, False, 0.89, 'C'],
['James', 78, True, 0.91, 'C'],
['Ava', 54, False, 0.73, 'B'],
['Henry', 69, True, 0.78, 'C']]
df = pd.DataFrame(x, columns=['Name', 'Weight', 'Option',
 'Rate', 'Type'])
df

      Name  Weight  Option  Rate Type
0  Jackson      68    True  0.82    A
1     Liam      74    True  1.10    B
2     Emma      52   False  0.89    C
3    James      78    True  0.91    C
4      Ava      54   False  0.73    B
5    Henry      69    True  0.78    C

In [119]:
x = df.iloc[2:4,1:-1]
x

   Weight  Option  Rate
2      52   False  0.89
3      78    True  0.91

In [120]:
x = [['Jackson', 68, True, 0.82, 'A'],
['Liam', 74, True, 1.1, 'B'],
['Emma', 52, False, 0.89, 'C'],
['James', 78, True, 0.91, 'C'],
['Ava', 54, False, 0.73, 'B'],
['Henry', 69, True, 0.78, 'C']]
df = pd.DataFrame(x, columns=['Name', 'Weight', 'Option',
 'Rate', 'Type'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Weight  6 non-null      int64
 2   Option  6 non-null      bool
 3   Rate    6 non-null      float64
 4   Type    6 non-null      object
dtypes: bool(1), float64(1), int64(1), object(2)
memory usage: 326.0+ bytes

In [124]:
x = [['Jackson', 68, True],
['Liam', 74, True],
['Emma', 52, False],
['James', 78, True],
['Ava', 54, False],
['Henry', 69, True]]
df = pd.DataFrame(x, columns=['Name', 'Weight', 'Option'])
df

      Name  Weight  Option
0  Jackson      68    True
1     Liam      74    True
2     Emma      52   False
3    James      78    True
4      Ava      54   False
5    Henry      69    True

In [125]:
df['Type'] = 'A'
df

      Name  Weight  Option Type
0  Jackson      68    True    A
1     Liam      74    True    A
2     Emma      52   False    A
3    James      78    True    A
4      Ava      54   False    A
5    Henry      69    True    A

In [127]:
df = df.rename(columns={'Type':'Grade'})
df

      Name  Weight  Option Grade
0  Jackson      68    True     A
1     Liam      74    True     A
2     Emma      52   False     A
3    James      78    True     A
4      Ava      54   False     A
5    Henry      69    True     A